## Plan Result (AzureDataFactory_Staging - TerraformPlanApply)




<pre><code>Plan: 22 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault.baubais_kv
  * azurerm_key_vault_secret.synapse_sql_password
  * azurerm_key_vault_secret.synapse_sql_username
  * azurerm_storage_account.adf_juror_sa
  * azurerm_storage_data_lake_gen2_filesystem.this
  * azurerm_subnet.adf_juror_subnet1
  * azurerm_synapse_spark_pool.this[0]
  * azurerm_synapse_sql_pool.this[0]
  * azurerm_synapse_workspace.this
  * azurerm_synapse_workspace_aad_admin.aad
  * azurerm_virtual_network.adf_juror_vnet
  * random_password.synapse_sql_password
  * module.datafactory.azurerm_data_factory.this
  * module.datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.datafactory.azurerm_resource_group.new[0]
  * module.storage.azapi_update_resource.defender_settings
  * module.storage.azurerm_storage_account.storage_account
  * module.storage.azurerm_storage_container.container[&#34;data&#34;]
  * module.storage.random_string.storage_account_random_string
  * module.storage.time_rotating.rotate
  * module.storage.time_static.pim_expiry
  * module.storage.time_static.pim_start




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault.baubais_kv will be created
  + resource "azurerm_key_vault" "baubais_kv" {
      + access_policy                 = [
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "881cece9-ee47-4c97-ab61-39bbe100893e"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "9811e238-e068-4802-a13c-f67a5945f03f"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = [
                  + "Get",
                  + "List",
                  + "Update",
                  + "Create",
                  + "Import",
                  + "Delete",
                  + "Recover",
                  + "Backup",
                  + "Restore",
                  + "ManageContacts",
                  + "ManageIssuers",
                  + "GetIssuers",
                  + "ListIssuers",
                  + "SetIssuers",
                  + "DeleteIssuers",
                ]
              + key_permissions         = [
                  + "Get",
                  + "List",
                  + "Update",
                  + "Create",
                  + "Import",
                  + "Delete",
                  + "Recover",
                  + "Backup",
                  + "Restore",
                  + "GetRotationPolicy",
                  + "SetRotationPolicy",
                  + "Rotate",
                ]
              + object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ]
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "baubais-stg-kv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "baubais-data-factory-rg-stg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "application"  = "dlrm-er"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # azurerm_key_vault_secret.synapse_sql_password will be created
  + resource "azurerm_key_vault_secret" "synapse_sql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "baubais-synapse-sql-password-stg"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.synapse_sql_username will be created
  + resource "azurerm_key_vault_secret" "synapse_sql_username" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "baubais-synapse-sql-username-stg"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_storage_account.adf_juror_sa will be created
  + resource "azurerm_storage_account" "adf_juror_sa" {
      + access_tier                        = (known after apply)
      + account_kind                       = "BlockBlobStorage"
      + account_replication_type           = "LRS"
      + account_tier                       = "Premium"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "baubaisadfsastg"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "baubais-data-factory-rg-stg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "application"  = "dlrm-er"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_storage_data_lake_gen2_filesystem.this will be created
  + resource "azurerm_storage_data_lake_gen2_filesystem" "this" {
      + default_encryption_scope = (known after apply)
      + group                    = (known after apply)
      + id                       = (known after apply)
      + name                     = "baubais-storage-data-lake-stg"
      + owner                    = (known after apply)
      + storage_account_id       = (known after apply)

      + ace (known after apply)
    }

  # azurerm_subnet.adf_juror_subnet1 will be created
  + resource "azurerm_subnet" "adf_juror_subnet1" {
      + address_prefixes                              = [
          + "10.0.2.0/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "baubais-adf-privateendpoints-stg"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "baubais-data-factory-rg-stg"
      + virtual_network_name                          = "baubais-adf-vnet-stg"
    }

  # azurerm_synapse_spark_pool.this[0] will be created
  + resource "azurerm_synapse_spark_pool" "this" {
      + cache_size                          = 100
      + compute_isolation_enabled           = false
      + dynamic_executor_allocation_enabled = false
      + id                                  = (known after apply)
      + name                                = "sparkstg"
      + node_count                          = (known after apply)
      + node_size                           = "Small"
      + node_size_family                    = "MemoryOptimized"
      + session_level_packages_enabled      = false
      + spark_events_folder                 = "/events"
      + spark_log_folder                    = "/logs"
      + spark_version                       = "3.2"
      + synapse_workspace_id                = (known after apply)
      + tags                                = {
          + "application"  = "dlrm-er"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }

      + auto_pause {
          + delay_in_minutes = 15
        }

      + auto_scale {
          + max_node_count = 10
          + min_node_count = 3
        }
    }

  # azurerm_synapse_sql_pool.this[0] will be created
  + resource "azurerm_synapse_sql_pool" "this" {
      + collation                 = (known after apply)
      + create_mode               = "Default"
      + geo_backup_policy_enabled = true
      + id                        = (known after apply)
      + name                      = "baubais_synapse_sql_stg"
      + sku_name                  = "DW100c"
      + storage_account_type      = "GRS"
      + synapse_workspace_id      = (known after apply)
      + tags                      = {
          + "application"  = "dlrm-er"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
    }

  # azurerm_synapse_workspace.this will be created
  + resource "azurerm_synapse_workspace" "this" {
      + azuread_authentication_only          = false
      + connectivity_endpoints               = (known after apply)
      + data_exfiltration_protection_enabled = false
      + id                                   = (known after apply)
      + location                             = "uksouth"
      + managed_resource_group_name          = "baubais-synapse"
      + managed_virtual_network_enabled      = true
      + name                                 = "baubais-synapse-stg"
      + public_network_access_enabled        = true
      + resource_group_name                  = "baubais-data-factory-rg-stg"
      + sql_administrator_login              = "sqladminuser"
      + sql_administrator_login_password     = (sensitive value)
      + sql_identity_control_enabled         = true
      + storage_data_lake_gen2_filesystem_id = (known after apply)
      + tags                                 = {
          + "application"  = "dlrm-er"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + timeouts {
          + create = "2h"
          + delete = "2h"
        }
    }

  # azurerm_synapse_workspace_aad_admin.aad will be created
  + resource "azurerm_synapse_workspace_aad_admin" "aad" {
      + id                   = (known after apply)
      + login                = "DTS Platform Operations"
      + object_id            = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + synapse_workspace_id = (known after apply)
      + tenant_id            = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_virtual_network.adf_juror_vnet will be created
  + resource "azurerm_virtual_network" "adf_juror_vnet" {
      + address_space       = [
          + "10.0.2.0/27",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "baubais-adf-vnet-stg"
      + resource_group_name = "baubais-data-factory-rg-stg"
      + subnet              = (known after apply)
      + tags                = {
          + "application"  = "dlrm-er"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
    }

  # random_password.synapse_sql_password will be created
  + resource "random_password" "synapse_sql_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 32
      + lower            = true
      + min_lower        = 4
      + min_numeric      = 4
      + min_special      = 0
      + min_upper        = 4
      + number           = true
      + numeric          = true
      + override_special = "#$%&@()_[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.datafactory.azurerm_data_factory.this will be created
  + resource "azurerm_data_factory" "this" {
      + id                              = (known after apply)
      + location                        = "uksouth"
      + managed_virtual_network_enabled = true
      + name                            = "baubais-data-factory-stg"
      + public_network_enabled          = false
      + resource_group_name             = "baubais-data-factory-rg-stg"
      + tags                            = {
          + "application"  = "dlrm-er"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }

      + github_configuration {
          + account_name       = "hmcts"
          + branch_name        = "main"
          + git_url            = "https://github.com"
          + publishing_enabled = true
          + repository_name    = "juror-er-infra"
          + root_folder        = "/adf"
        }
    }

  # module.datafactory.azurerm_data_factory_integration_runtime_azure.this will be created
  + resource "azurerm_data_factory_integration_runtime_azure" "this" {
      + cleanup_enabled         = true
      + compute_type            = "General"
      + core_count              = 8
      + data_factory_id         = (known after apply)
      + id                      = (known after apply)
      + location                = "autoresolve"
      + name                    = "AutoResolveIntegrationRuntime"
      + time_to_live_min        = 0
      + virtual_network_enabled = true
    }

  # module.datafactory.azurerm_resource_group.new[0] will be created
  + resource "azurerm_resource_group" "new" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "baubais-data-factory-rg-stg"
      + tags     = {
          + "application"  = "dlrm-er"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
    }

  # module.storage.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.storage.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                        = "Hot"
      + account_kind                       = "BlockBlobStorage"
      + account_replication_type           = "LRS"
      + account_tier                       = "Premium"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "synapsebaubaisstg"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "baubais-data-factory-rg-stg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "application"  = "dlrm-er"
          + "builtFrom"    = "hmcts/juror-er-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }

      + blob_properties (known after apply)

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.storage.azurerm_storage_container.container["data"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "data"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "synapsebaubaisstg"
    }

  # module.storage.random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.storage.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.storage.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

Plan: 22 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label AzureDataFactory_Staging - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/juror-er-infra/issues/12/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":12,"Program":"tfcmt","SHA1":"","Target":"AzureDataFactory_Staging - TerraformPlanApply","Vars":{}} -->